xml/data/BasicHttpBinding_USCOREDataServiceSoap.SubmitChanges.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
 xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns4="http://schemas.microsoft.com/2003/10/Serialization/"
 xmlns:ns5="http://schemas.datacontract.org/2004/07/Medius.Gemini.ClientModel"
 xmlns:ns6="http://schemas.microsoft.com/2003/10/Serialization/Arrays"
 xmlns:ns3="DomainServices"
 xmlns:ns1="http://tempuri.org/">
 <SOAP-ENV:Body>
   <ns1:SubmitChanges>
    <ns1:changeSet>
     <ns3:ChangeSetEntry>
      <ns3:Associations>
       <ns6:KeyValueOfstringArrayOfintty7Ep6D1>
        <ns6:Key></ns6:Key>
        <ns6:Value>
         <ns6:int>0</ns6:int>
         <ns6:int>0</ns6:int>
         <!-- extensibility element(s) -->

        </ns6:Value>
       </ns6:KeyValueOfstringArrayOfintty7Ep6D1>
       <ns6:KeyValueOfstringArrayOfintty7Ep6D1>
        <ns6:Key></ns6:Key>
        <ns6:Value>
         <ns6:int>0</ns6:int>
         <ns6:int>0</ns6:int>
         <!-- extensibility element(s) -->

        </ns6:Value>
       </ns6:KeyValueOfstringArrayOfintty7Ep6D1>
       <!-- extensibility element(s) -->

      </ns3:Associations>
      <ns3:ConflictMembers>
       <ns6:string></ns6:string>
       <ns6:string></ns6:string>
       <!-- extensibility element(s) -->

      </ns3:ConflictMembers>
      <ns3:Entity></ns3:Entity>
      <ns3:EntityActions>
       <ns6:KeyValueOfstringArrayOfanyTypety7Ep6D1>
        <ns6:Key></ns6:Key>
        <ns6:Value>
         <ns6:anyType></ns6:anyType>
         <ns6:anyType></ns6:anyType>
         <!-- extensibility element(s) -->

        </ns6:Value>
       </ns6:KeyValueOfstringArrayOfanyTypety7Ep6D1>
       <ns6:KeyValueOfstringArrayOfanyTypety7Ep6D1>
        <ns6:Key></ns6:Key>
        <ns6:Value>
         <ns6:anyType></ns6:anyType>
         <ns6:anyType></ns6:anyType>
         <!-- extensibility element(s) -->

        </ns6:Value>
       </ns6:KeyValueOfstringArrayOfanyTypety7Ep6D1>
       <!-- extensibility element(s) -->

      </ns3:EntityActions>
      <ns3:HasMemberChanges>false</ns3:HasMemberChanges>
      <ns3:Id>0</ns3:Id>
      <ns3:IsDeleteConflict>false</ns3:IsDeleteConflict>
      <ns3:Operation>None</ns3:Operation>
      <ns3:OriginalAssociations>
       <ns6:KeyValueOfstringArrayOfintty7Ep6D1>
        <ns6:Key></ns6:Key>
        <ns6:Value>
         <ns6:int>0</ns6:int>
         <ns6:int>0</ns6:int>
         <!-- extensibility element(s) -->

        </ns6:Value>
       </ns6:KeyValueOfstringArrayOfintty7Ep6D1>
       <ns6:KeyValueOfstringArrayOfintty7Ep6D1>
        <ns6:Key></ns6:Key>
        <ns6:Value>
         <ns6:int>0</ns6:int>
         <ns6:int>0</ns6:int>
         <!-- extensibility element(s) -->

        </ns6:Value>
       </ns6:KeyValueOfstringArrayOfintty7Ep6D1>
       <!-- extensibility element(s) -->

      </ns3:OriginalAssociations>
      <ns3:OriginalEntity></ns3:OriginalEntity>
      <ns3:StoreEntity></ns3:StoreEntity>
      <ns3:ValidationErrors>
       <ns3:ValidationResultInfo>
        <ns3:ErrorCode>0</ns3:ErrorCode>
        <ns3:Message></ns3:Message>
        <ns3:SourceMemberNames>
         <ns6:string></ns6:string>
         <ns6:string></ns6:string>
         <!-- extensibility element(s) -->

        </ns3:SourceMemberNames>
        <ns3:StackTrace></ns3:StackTrace>
        <!-- extensibility element(s) -->

       </ns3:ValidationResultInfo>
       <ns3:ValidationResultInfo>
        <ns3:ErrorCode>0</ns3:ErrorCode>
        <ns3:Message></ns3:Message>
        <ns3:SourceMemberNames>
         <ns6:string></ns6:string>
         <ns6:string></ns6:string>
         <!-- extensibility element(s) -->

        </ns3:SourceMemberNames>
        <ns3:StackTrace></ns3:StackTrace>
        <!-- extensibility element(s) -->

       </ns3:ValidationResultInfo>
       <!-- extensibility element(s) -->

      </ns3:ValidationErrors>
      <!-- extensibility element(s) -->

     </ns3:ChangeSetEntry>
     <ns3:ChangeSetEntry>
      <ns3:Associations>
       <ns6:KeyValueOfstringArrayOfintty7Ep6D1>
        <ns6:Key></ns6:Key>
        <ns6:Value>
         <ns6:int>0</ns6:int>
         <ns6:int>0</ns6:int>
         <!-- extensibility element(s) -->

        </ns6:Value>
       </ns6:KeyValueOfstringArrayOfintty7Ep6D1>
       <ns6:KeyValueOfstringArrayOfintty7Ep6D1>
        <ns6:Key></ns6:Key>
        <ns6:Value>
         <ns6:int>0</ns6:int>
         <ns6:int>0</ns6:int>
         <!-- extensibility element(s) -->

        </ns6:Value>
       </ns6:KeyValueOfstringArrayOfintty7Ep6D1>
       <!-- extensibility element(s) -->

      </ns3:Associations>
      <ns3:ConflictMembers>
       <ns6:string></ns6:string>
       <ns6:string></ns6:string>
       <!-- extensibility element(s) -->

      </ns3:ConflictMembers>
      <ns3:Entity></ns3:Entity>
      <ns3:EntityActions>
       <ns6:KeyValueOfstringArrayOfanyTypety7Ep6D1>
        <ns6:Key></ns6:Key>
        <ns6:Value>
         <ns6:anyType></ns6:anyType>
         <ns6:anyType></ns6:anyType>
         <!-- extensibility element(s) -->

        </ns6:Value>
       </ns6:KeyValueOfstringArrayOfanyTypety7Ep6D1>
       <ns6:KeyValueOfstringArrayOfanyTypety7Ep6D1>
        <ns6:Key></ns6:Key>
        <ns6:Value>
         <ns6:anyType></ns6:anyType>
         <ns6:anyType></ns6:anyType>
         <!-- extensibility element(s) -->

        </ns6:Value>
       </ns6:KeyValueOfstringArrayOfanyTypety7Ep6D1>
       <!-- extensibility element(s) -->

      </ns3:EntityActions>
      <ns3:HasMemberChanges>false</ns3:HasMemberChanges>
      <ns3:Id>0</ns3:Id>
      <ns3:IsDeleteConflict>false</ns3:IsDeleteConflict>
      <ns3:Operation>None</ns3:Operation>
      <ns3:OriginalAssociations>
       <ns6:KeyValueOfstringArrayOfintty7Ep6D1>
        <ns6:Key></ns6:Key>
        <ns6:Value>
         <ns6:int>0</ns6:int>
         <ns6:int>0</ns6:int>
         <!-- extensibility element(s) -->

        </ns6:Value>
       </ns6:KeyValueOfstringArrayOfintty7Ep6D1>
       <ns6:KeyValueOfstringArrayOfintty7Ep6D1>
        <ns6:Key></ns6:Key>
        <ns6:Value>
         <ns6:int>0</ns6:int>
         <ns6:int>0</ns6:int>
         <!-- extensibility element(s) -->

        </ns6:Value>
       </ns6:KeyValueOfstringArrayOfintty7Ep6D1>
       <!-- extensibility element(s) -->

      </ns3:OriginalAssociations>
      <ns3:OriginalEntity></ns3:OriginalEntity>
      <ns3:StoreEntity></ns3:StoreEntity>
      <ns3:ValidationErrors>
       <ns3:ValidationResultInfo>
        <ns3:ErrorCode>0</ns3:ErrorCode>
        <ns3:Message></ns3:Message>
        <ns3:SourceMemberNames>
         <ns6:string></ns6:string>
         <ns6:string></ns6:string>
         <!-- extensibility element(s) -->

        </ns3:SourceMemberNames>
        <ns3:StackTrace></ns3:StackTrace>
        <!-- extensibility element(s) -->

       </ns3:ValidationResultInfo>
       <ns3:ValidationResultInfo>
        <ns3:ErrorCode>0</ns3:ErrorCode>
        <ns3:Message></ns3:Message>
        <ns3:SourceMemberNames>
         <ns6:string></ns6:string>
         <ns6:string></ns6:string>
         <!-- extensibility element(s) -->

        </ns3:SourceMemberNames>
        <ns3:StackTrace></ns3:StackTrace>
        <!-- extensibility element(s) -->

       </ns3:ValidationResultInfo>
       <!-- extensibility element(s) -->

      </ns3:ValidationErrors>
      <!-- extensibility element(s) -->

     </ns3:ChangeSetEntry>
     <!-- extensibility element(s) -->

    </ns1:changeSet>
   </ns1:SubmitChanges>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
